#Задача 12: Петя и Катя – брат и сестра. 
#Петя – студент, а Катя – школьница. 
#Петя помогает Кате по математике. 
#Он задумывает два натуральных числа X и Y (X,Y≤1000),
#а Катя должна их отгадать. Для этого Петя делает две подсказки. 
#Он называет сумму этих чисел S и их произведение P. 
#Помогите Кате отгадать задуманные Петей числа.

# 44 >22; 56 > 23

sum1 = int(input('Summ: '))
mult = int(input('Multipller: '))
a = int(sum1 - (sum1 ** 2 - 4 * mult) ** 0.5) // 2
b = int(sum1 + (sum1 ** 2 - 4 * mult) ** 0.5) // 2 
print(a, b)
